# -*- coding:utf-8 -*-
import tensorflow as tf 
#最初学习率
LEARNING_RATE_BASE = 0.1
#学习衰减率
LEARNING_RATE_DECAY = 0.99
#喂入多少轮BATCH_SIZE后更新一次学习率，一般为:样本总数/BATCH_SIZE
LEARNING_RATE_STEP = 1
#定义计数器
global_step = tf.Variable(0, trainable=False)
#定义指数衰减学习率
learning_rate = tf.train.exponential_decay(LEARNING_RATE_BASE, global_step, LEARNING_RATE_STEP, 
		LEARNING_RATE_DECAY, staircase=True)
#定义待优化参数，初始值10
w = tf.Variable(tf.constant(5, dtype=tf.float32))
#定义损失函数
loss = tf.square(w+1)
#定义方向传播方法：梯度下降
train_step = tf.train.GradientDescentOptimizer(learning_rate).minimize(loss, global_step=global_step)
#生成会话，开始训练40次
with tf.Session() as sess:
	init_op = tf.global_variables_initializer()
	sess.run(init_op)
	for i in range(40):
		sess.run(train_step)
		learning_rate_val = sess.run(learning_rate)
		global_step_val = sess.run(global_step)
		w_val = sess.run(w)
		loss_val = sess.run(loss)
		print("经过%s次训练,学习率:%f,计数器:%f,待优化w:%f,损失函数:%f"%(i+1,learning_rate_val,global_step_val,w_val,loss_val))
# 经过1次训练,学习率:0.099000,计数器:1.000000,待优化w:3.800000,损失函数:23.040001
# 经过2次训练,学习率:0.098010,计数器:2.000000,待优化w:2.849600,损失函数:14.819419
# 经过3次训练,学习率:0.097030,计数器:3.000000,待优化w:2.095001,损失函数:9.579033
# 经过4次训练,学习率:0.096060,计数器:4.000000,待优化w:1.494386,损失函数:6.221961
# 经过5次训练,学习率:0.095099,计数器:5.000000,待优化w:1.015167,损失函数:4.060896
# 经过6次训练,学习率:0.094148,计数器:6.000000,待优化w:0.631886,损失函数:2.663051
# 经过7次训练,学习率:0.093207,计数器:7.000000,待优化w:0.324608,损失函数:1.754587
# 经过8次训练,学习率:0.092274,计数器:8.000000,待优化w:0.077684,损失函数:1.161403
# 经过9次训练,学习率:0.091352,计数器:9.000000,待优化w:-0.121202,损失函数:0.772287
# 经过10次训练,学习率:0.090438,计数器:10.000000,待优化w:-0.281761,损失函数:0.515867
# 经过11次训练,学习率:0.089534,计数器:11.000000,待优化w:-0.411674,损失函数:0.346128
# 经过12次训练,学习率:0.088638,计数器:12.000000,待优化w:-0.517024,损失函数:0.233266
# 经过13次训练,学习率:0.087752,计数器:13.000000,待优化w:-0.602644,损失函数:0.157891
# 经过14次训练,学习率:0.086875,计数器:14.000000,待优化w:-0.672382,损失函数:0.107334
# 经过15次训练,学习率:0.086006,计数器:15.000000,待优化w:-0.729305,损失函数:0.073276
# 经过16次训练,学习率:0.085146,计数器:16.000000,待优化w:-0.775868,损失函数:0.050235
# 经过17次训练,学习率:0.084294,计数器:17.000000,待优化w:-0.814036,损失函数:0.034583
# 经过18次训练,学习率:0.083451,计数器:18.000000,待优化w:-0.845387,损失函数:0.023905
# 经过19次训练,学习率:0.082617,计数器:19.000000,待优化w:-0.871193,损失函数:0.016591
# 经过20次训练,学习率:0.081791,计数器:20.000000,待优化w:-0.892476,损失函数:0.011561
# 经过21次训练,学习率:0.080973,计数器:21.000000,待优化w:-0.910065,损失函数:0.008088
# 经过22次训练,学习率:0.080163,计数器:22.000000,待优化w:-0.924629,损失函数:0.005681
# 经过23次训练,学习率:0.079361,计数器:23.000000,待优化w:-0.936713,损失函数:0.004005
# 经过24次训练,学习率:0.078568,计数器:24.000000,待优化w:-0.946758,损失函数:0.002835
# 经过25次训练,学习率:0.077782,计数器:25.000000,待优化w:-0.955125,损失函数:0.002014
# 经过26次训练,学习率:0.077004,计数器:26.000000,待优化w:-0.962106,损失函数:0.001436
# 经过27次训练,学习率:0.076234,计数器:27.000000,待优化w:-0.967942,损失函数:0.001028
# 经过28次训练,学习率:0.075472,计数器:28.000000,待优化w:-0.972830,损失函数:0.000738
# 经过29次训练,学习率:0.074717,计数器:29.000000,待优化w:-0.976931,损失函数:0.000532
# 经过30次训练,学习率:0.073970,计数器:30.000000,待优化w:-0.980378,损失函数:0.000385
# 经过31次训练,学习率:0.073230,计数器:31.000000,待优化w:-0.983281,损失函数:0.000280
# 经过32次训练,学习率:0.072498,计数器:32.000000,待优化w:-0.985730,损失函数:0.000204
# 经过33次训练,学习率:0.071773,计数器:33.000000,待优化w:-0.987799,损失函数:0.000149
# 经过34次训练,学习率:0.071055,计数器:34.000000,待优化w:-0.989550,损失函数:0.000109
# 经过35次训练,学习率:0.070345,计数器:35.000000,待优化w:-0.991035,损失函数:0.000080
# 经过36次训练,学习率:0.069641,计数器:36.000000,待优化w:-0.992297,损失函数:0.000059
# 经过37次训练,学习率:0.068945,计数器:37.000000,待优化w:-0.993369,损失函数:0.000044
# 经过38次训练,学习率:0.068255,计数器:38.000000,待优化w:-0.994284,损失函数:0.000033
# 经过39次训练,学习率:0.067573,计数器:39.000000,待优化w:-0.995064,损失函数:0.000024
# 经过40次训练,学习率:0.066897,计数器:40.000000,待优化w:-0.995731,损失函数:0.000018
